{ "sets": [{
  "name": "Garage Center",
  "description": "Give your young car mechanic a great start with this multi-vehicle set, inspired by the new-for-2019 LEGO® City TV series. This LEGO 4+ toy set is specially designed to be fun and easy for preschoolers and youngsters, featuring a car wash building, plus a sports car, tow truck and gas tanker, garage and gas station pump stand with special Starter Brick chassis and bases that let even first-time builders experience the pride of constructing buildings, vehicles and more, all on their own. The included simple guide to build and play will also help your young creator understand the purpose of the building steps and grow their imagination and confidence for the perfect start to LEGO brick building in a familiar LEGO City setting. Then give your young LEGO builder an amazing building experience with Instructions PLUS, available in the LEGO Life app for smartphones and tablets. The easy-to-use, intuitive building instructions let them zoom, rotate and visualize their creation using the special ghost mode as they go. Instructions PLUS is also great for younger builders, guiding them through the building process for a greater sense of independence and achievement. This cool toy playset includes 4 minifigures.",
  "price": 49.99,
  "rating": 0,
  "ages": "4+",
  "pieces": 234,
  "vipPoints": 49,
  "id": "1"
  
  }, {
    "name": "Empire State Building",
    "description": "Elevate your LEGO® building skills to a higher level with this LEGO Architecture 21046 Empire State Building set. Located at the heart of New York City, the Empire State Building towers above the surrounding skyscrapers. Construction of the building began on March 17, 1930 and just one year and 45 days later, on May 1, 1931 it was opened for business. The height of the structure was increased in 1950 with the addition of the iconic antenna tower. At 21” (55cm), the tallest LEGO Architecture model to date (July 2019), this highly detailed, collectible replica accurately recreates the symmetrical lines of the building’s 4 curtain wall facades and art deco antenna tower. The tiled baseplate depicts Fifth Avenue and surrounding roads complete with yellow cabs, and the model is finished with a decorative nameplate. This 360°-displayable model delivers an interesting and rewarding building experience and makes a truly iconic centerpiece for the home and office. It has been developed for all with an interest in travel, architectural culture, history and design.",
    "price": 129.99,
    "rating": 0,
    "ages": "16+",
    "pieces": 1767,
     "vipPoints": 129,
    "id": "2"
    }, {
      "name": "NASA Apollo 11 Lunar Lander",
      "description": "Celebrate man’s first moon landing with this LEGO® Creator Expert 10266 NASA Apollo 11 Lunar Lander building set—developed in cooperation with NASA to mark the 50th anniversary of a historical event that captivated the world. This collectible model features a highly detailed replica of Apollo 11's Eagle lunar module, plus a depiction of the lunar surface, complete with crater, footprints and a U.S. flag. The descent stage comes with gold-colored landing pads and panels, opening camera and laser hatches, and a ladder, while the ascent stage has a detailed interior with room for 2 astronauts. Finished with an Apollo 11 Lunar Lander nameplate, this display model makes a great centerpiece for the home or office and provides a challenging and rewarding building experience full of nostalgia. Includes 2 astronaut minifigures with NASA decoration and golden helmets.",
      "price": 99.99,
      "rating": 0,
      "ages": "16+",
      "pieces": 1087,
       "vipPoints": 99,
      "id": "3"
      }, {
        "name": "The Upside Down",
        "description": "Fans of the global hit Netflix original series will appreciate the authentic details of this highly collectible LEGO® Stranger Things toy – 75810 The Upside Down. This sturdy, brick-built model can flip between the real world and The Upside Down. The design of the model's building instructions makes it a great shared building experience with friends and family. The Byers' house features Will's bedroom, the living room and the dining room. The Upside Down version of the house, from an alternate dimension, features all the rooms from the real-world model but with a dark, vine-covered, dilapidated look that fans will instantly recognize from the series. With 8 Stranger Things figures, each with its own accessories, this playset makes a great gift for Stranger Things fans who will love to build and display this model to show their passion for the series.",
        "price": 199.99,
        "rating": 0,
        "ages": "16+",
        "pieces": 2287,
         "vipPoints": 199,
        "id": "4"
        }, {
          "name": "Tantive IV",
          "description": "Build, play and display a legendary Star Wars™ starship! This LEGO® Star Wars 75244 interpretation of Tantive IV, seen fleeing from an Imperial Star Destroyer in the opening moments of Star Wars: A New Hope, faithfully recreates all of the Rebel cruiser's signature details, including an elongated hull, detachable escape pods, elevating gun turrets, cargo hold and 11 massive engines at the back. Remove the hull plating of this fantastic LEGO Star Wars vehicle to reveal a detailed 2-minifigure cockpit, conference area with table, weapon rack and a control console with 2 seats. The radar dish also doubles as a convenient carry handle, which makes it perfect for flying around the room. When the mission is over, this amazing kids’ buildable toy also makes a great centerpiece for any LEGO Star Wars collection. The set also includes 5 minifigures and an R2-D2 droid LEGO figure.",
          "price": 199.99,
          "rating": 0,
          "ages": "12+",
          "pieces": 1768,
           "vipPoints": 199,
          "id": "5"
          }, {
            "name": "Disney Series 2",
            "description": "Bring exciting new play possibilities to any LEGO® set with the LEGO Minifigures 71024 Disney Series 2. This new-for-May-2019 collection features a magical lineup of exclusive, Limited Edition Disney characters. Say hello to Vintage Mickey, Vintage Minnie, Hercules, Jack Skellington, Scrooge McDuck, Huey, Dewey, Louie, Chip, Dale, Jasmine, Jafar, Hades, Elsa, Anna, Sally, Edna and Frozone! Each Disney minifigure comes in a sealed ‘mystery' bag together with one or more accessory elements, plus a collector’s leaflet and a unique display baseplate.",
            "price": 3.99,
            "rating": 0,
            "ages": "5+",
            "pieces": 7,
             "vipPoints": 3,
            "id": "6"
            }, {
              "name": "Carnival Thrill Coaster",
              "description": "Share the excitement and joy of a carnival with you child, with the Disney•Pixar Toy Story 4 10771 Carnival Thrill Coaster LEGO® 4+ construction toy! The action-packed play set is specially designed to be fun and easy for preschoolers and smaller children. This great set features a colorful carnival roller coaster with 3 cars, 6 sturdy track sections and a large entrance arch with spinning turnstile, plus a special Starter Brick baseplate that gives first-time builders the experience and pride of constructing buildings, vehicles and more on their own. This fun preschool toy building set also comes with a cute ice cream wagon with balloon and pizza pie. The included simple guide to build and play will also help your young carnival visitor understand the purpose of the building steps and grow their imagination and confidence for the perfect start to easy LEGO brick building in a fun Toy Story setting. Includes Buzz Lightyear and Alien minifigures.",
              "price": 19.99,
              "rating": 0,
              "ages": "4+",
              "pieces": 98,
               "vipPoints": 19,
              "id": "7"
              }
    
]
}